<!DOCTYPE html>
<html>
    <head>
        <link href="https://fonts.googleapis.com/css2?family=Yatra+One&display=swap" rel="stylesheet">
        <link href="https://fonts.googleapis.com/css2?family=Lora&display=swap" rel="stylesheet">
        <link rel="stylesheet" href="/css/design.css">
        <link rel="stylesheet" href="/css/nav.css">
        <script src="/scripts/jquery-3.5.1.min.js"></script>
    </head>
    <body>
        <script src="/scripts/loader.js"></script>
        <header></header>

        <article>
            <div class="article_mitte">
                <fieldset class="personInfoBox">
                    <img src="/img/shinobu-oshino.jpg"/>
                    <p>
                        <span class="personName">Kiss-Shot Acerola-Orion Heart-Under-Blade</span>
                        <br/>
                        Ein 500 Jahre alter &uuml;berm&auml;chtiger Vampir. Wurde jedoch im Kampf gegen 3 Vampirj&auml;ger 
                        schwer verletzt und b&uuml;ste so den gro&szlig;teil ihrer Kraft ein. Wurde jedoch von Koyomi Araragi
                        gerettet, welcher in folge seiner "Blitsp&auml;nde" ebenfalls zum Vampir wurde.
                        Durch ihre Hilfe gelang es Araragi auch die besagten Vampirj&auml;ger zu besiegen.
                        Seit dem teilen sich die beiden ihre Vampirkr&auml;fte und sie lebt die meiste Zeit in seinem Schatten.
                        Als folge ihrer nun eingeschr&auml;nkten kr&auml;fte ist sie die meiste Zeit &uuml;ber nicht in der Lage
                        ihre urspr&uuml;ngliche gestahtlt aufrecht zu halten und erscheint folglich meist in eine "kleineren" gestallt.
                        Desweiterin hat sie ein Vorliebe f&uuml;r Donats.
                        <br/>
                        <a href="mailto:Shinobu.Oshino@Monogatari.de" class="personMail">Shinobu.Oshino@Monogatari.de</a>
                    </p>
                </fieldset>
                <fieldset class="personInfoBox">
                    <img src="/img/brendel.jpeg"/>
                    <p>
                        <span class="personName">Benjamin Brendel</span>
                        <br/>
                        Meine Hauptaufgaben beim Projekt waren das Protokollieren der wichtigsten Punkte bei den 
                        w&ouml;chentlichen Meetings und das Pr&uuml;fen von Texten auf Rechtschreibung, Kommasetzung etc. 
                        Ebenso habe ich bei der grafischen Nutzeroberfl&auml;che mitgewirkt. Besonders stolz bin ich 
                        darauf, Urheber des Projektnamens zu sein.
                        <br/>
                        <!-- <a href="mailto:mail" class="personMail">Mail</a> -->
                    </p>
                </fieldset>
                <fieldset class="personInfoBox">
                    <img src="/img/fischer.jpeg"/>
                    <p>
                        <span class="personName">Lukas Fischer</span>
                        <br/>
                        HI, ich bin Lukas und bei einem Gruppenprojekt koordiniere ich sehr gerne die einzelnen 
                        Aufgaben und verfolge den Arbeitsfluss. Ich wei&szlig; h&auml;ufig &uuml;ber die St&auml;rken und Schw&auml;chen 
                        meiner Mitmenschen Bescheid und sorge dabei h&auml;ufig daf&uuml;r, dass jeder seine St&auml;rken 
                        bestm&ouml;glich einbringen kann. Bei diesem Projekt habe ich daher die Rolle des Teamleiters 
                        &uuml;bernommen. In meinem Aufgabenbereich lagen somit die zeitliche Koordination des Projekts, 
                        der Kontakt mit unserem Auftraggeber sowie weiteren f&uuml;r das Projekt relevanten Personen 
                        und die Verteilung von Aufgaben an mein Team. Im zweiten Teil des Projekts habe ich des 
                        Weiteren am Nutzerinterface mitgewirkt.
                        <br/>
                        <!-- <a href="mailto:mail" class="personMail">Mail</a> -->
                    </p>
                </fieldset>
                <fieldset class="personInfoBox">
                    <img src="/img/genthe.jpeg"/>
                    <p>
                        <span class="personName">Ken Eric Genthe</span>
                        <br/>
                        Mein Name ist Ken (Eric) Genthe, ich komme ursprünglich aus Schleswig-Holstein und seit 2017 
                        studiere ich Informatik an der Hochschule Harz in Wernigerode.
                        In der ersten Hälfte des Projektes beschäftigte ich mich mit Recherchen zu verschiedenster 
                        Hardware und informierte mich über eine Open-Source-Projekt-Alternative. 
                        In der zweiten Hälfte kümmerte ich mich hauptsächlich um die Videopräsentation für das Projekt 
                        und um das dazugehörige Skript, welches im Tonstudio der Hochschule Harz eingesprochen wurde.
                        <br/>
                        <a href="mailto:ken-genthe@gmx.de" class="personMail">ken-genthe@gmx.de</a>
                    </p>
                </fieldset>
                <fieldset class="personInfoBox">
                    <img src="/img/maffenbeier.jpeg"/>
                    <p>
                        <span class="personName">Daniel Maffenbeier</span>
                        <br/>
                        Ich bin Daniel Maffenbeier und bin von 2017 bis 2021 Informatikstudent an der Hochschule Harz. 
                        Bei diesem Projekt war ich haupts&auml;chlich f&uuml;r die Planung und Durchf&uuml;hrung von Testreihen zust&auml;ndig. 
                        Au&szlig;erdem war ich an der Erstellung der Nutzerschnittstelle zur Steuerung und der Website beteiligt.
                        <br/>
                        <!-- <a href="mailto:mail" class="personMail">Mail</a> -->
                    </p>
                </fieldset>
                <fieldset class="personInfoBox">
                    <img src="/img/naujokat.jpeg"/>
                    <p>
                        <span class="personName">Dennis Naujokat</span>
                        <br/>
                        Ich studiere seit 2017 Informatik auf Bachelor-Niveau an der Hochschule Harz.
                        <br/>
                        Ich habe mich f&uuml;r diesen Fachbereich entschieden, da ich mich schon fr&uuml;her gerne mit dem L&ouml;sen komplexer
                        Probleme besch&auml;ftigt habe. Seitdem ich ich das erste mal mit dem Programmieren in Kontakt kamm,
                        bin ich davon begeistert.
                        <br/>
                        In diesem Projekt waren meine prim&auml;ren Aufgaben, dass schreiben der Automatisierung in FHEM und das
                        Erstellen der LSF-Schnittstelle.
                        <br/>
                        <a href="mailto:dennis.naujokat.business@gmail.com" class="personMail">Dennis.Naujokat.Business@gmail.com</a>
                    </p>
                </fieldset>
                <fieldset class="personInfoBox">
                    <img src="/img/niemand.JPG"/>
                    <p>
                        <span class="personName">Fritz Niemann</span>
                        <br/>
                        Ich bin am 04. Februar in Stendal geboren. Im Jahr 2017 habe ich mein Abitur an 
                        dem Rudolf-Hildbrand-Gymnasium gemacht. Im Moment studiere ich Informatik  an der 
                        Hochschule Harz.  
                        <br/>
                        In meiner Freizeit spiele ich seit der 3. Klasse Schach im Verein. Au&szlig;erdem 
                        organisiere ich seit einigen Jahren eine Schach AG f&uuml;r Kinder und Jugendliche. 
                        Als k&ouml;rperliche Ausgleich gehe ich gerne wandern und fahre Inliner. Im Rahmen meiner 
                        Ausbildung habe ich eine grundlegende Einf&uuml;hrung in Englisch erhalten.
                        <br/>
                        <a href="mailto:fritz.sdl@freenet.de" class="personMail">fritz.sdl@freenet.de</a>
                    </p>
                </fieldset>
                <fieldset class="personInfoBox">
                    <img src="/img/ralfs.jpeg"/>
                    <p>
                        <span class="personName">Eric Ralfs</span>
                        <br/>
                        Ich bin Eric Ralfs und komme aus Schleswig Holstein. Von 2017 bis vorrausichtlich 2021 
                        studiere ich Informatik hier an der Hochschule Harz. In diesem Projekt hatte ich Aufgaben 
                        im Bereich der Recherche, der Testreihen und gegen Ende arbeitete ich an dem Pr&auml;sentationsvideo.
                        <br/>
                        <a href="mailto:ericralfs@web.de" class="personMail">ericralfs@web.de</a>
                    </p>
                </fieldset>
                <fieldset class="personInfoBox">
                    <img src="/img/viererbe.png"/>
                    <p>
                        <span class="personName">Dominik Viererbe</span>
                        <br/>
                        -----BEGIN GEEK CODE BLOCK-----
                        <br/>
                        Version: 3.1
                        <br/>
                        GCS/IT/M/S d--(-) s:+> a-- C++(+)$ ULC@ P--- L+(++) !E@ W++ N? o? K--? w++ !O-- !M- V? PS++(+) PE- Y++(+) PGP++ t+(+++) !5 X(+) R(+)>++ tv-- b++(+++)>+++ DI !D G e+>+++ h !r y?
                        <br/>
                        ------END GEEK CODE BLOCK------
                        <br/>
                        <br/>
                        Cyrnfr qba'g whqtr zr ol guvf cebwrpg. Jr nyy unq guvf fbeg bs cebwrpg gung qvq'g ghea bhg gung terng, ohg v yrnearq n ybg nobhg ubj vzcbegnag grnz pbzzhavpngvba naq zbgvingvba vf. (Hint: Caesar)
                        <br/>
                        <!-- <a href="mailto:mail" class="personMail">Mail</a> -->
                    </p>
                </fieldset>
                <fieldset class="personInfoBox">
                    <img src="/img/wawrik.jpeg"/>
                    <p>
                        <span class="personName">Tobias Wawrik</span>
                        <br/>
                        Ich bin Tobias Wawrik und studiere seit 2017 bis voraussichtlich 2021 an der Hochschule Harz.
                        <br/>
                        Ich wurde mit der Aufgabe betreut einen Fragebogen zu erstellen, welcher uns dabei helfen sollte 
                        die derzeitige Situation der Hochschule zu analysieren. Anschlie&szlig;end war ich f&uuml;r die Visualisierung 
                        unserer Thermalsimulation zust&auml;ndig und vertonte zudem das Pr&auml;sentationsvideo.
                        <br/>
                        <a href="mailto:t.wawrik@web.de" class="personMail">t.wawrik@web.de</a>
                    </p>
                </fieldset>
            </div>
        </article>

        <footer></footer>
    </body>
</html>