<!DOCTYPE html>
<html>
    <head>
        <link href="https://fonts.googleapis.com/css2?family=Yatra+One&display=swap" rel="stylesheet">
        <link href="https://fonts.googleapis.com/css2?family=Lora&display=swap" rel="stylesheet">
        <link rel="stylesheet" href="/css/design.css">
        <link rel="stylesheet" href="/css/nav.css">
        <script src="/scripts/jquery-3.5.1.min.js"></script>
    </head>
    <body>
        <script src="/scripts/loader.js"></script>
        <header></header>

        <article>
            <div class="article_mitte">
                <h1>Installation</h1>
                <ol>
                    <li>Installiere das FHEM-Paket &bdquo;FHEM Tablet UI&ldquo;. (siehe <a href="https://wiki.fhem.de/wiki/FHEM_Tablet_UI">hier</a>)</li>
                    <li>Kopiere den Inhalt des Repositories in das Stammverzeichnis von FHEM.</li>
                    <li>F&uuml;hre die Perlfunktion <code>Sven_init()</code> in FHEM aus.</li>
                </ol>
                <br/><br/>
                <h1>Automatisierung</h1>
Die Automatisierung in FHEM ist &uuml;ber zwei Moduldateien definiert: eine f&uuml;r die LSF-Schnittstelle und eine f&uuml;r die eigentliche Automatisierung. In beiden Dateien sind verschiedene Perlfunktionen definiert, um die Automatisierung umzusetzen. Das System ist dabei so konzipiert, das die Anwendung f&uuml;r den Administrator so einfach wie m&ouml;glich ist. Dieser muss zu Beginn nur die Funktion &bdquo;Sven_init&ldquo; ausf&uuml;hren und kann danach &uuml;ber die Benutzeroberfl&auml;che mit dem System interagieren.
<br/><br/>
&Uuml;ber das FHEM-Ger&auml;t &bdquo;Sven_Manager&ldquo; k&ouml;nnen dann einfach R&auml;ume hinzugef&uuml;gt und entfernt werden. Wichtig ist dabei, dass der Name mit dem im LSF hinterlegten Namen des Raumes &uuml;bereinstimmt (wobei Leerzeichen durch Unterstriche ersetzt werden). Danach werden automatisiert verschiedene Ger&auml;te in FHEM angelegt, die die Automatisierung und Steuerung &uuml;bernehmen, sowie ein Webinterface f&uuml;r den Raum generiert (siehe 6.6).
<br/><br/>
Die wichtigsten Ger&auml;te im Raum sind die vier Manager Ger&auml;te. Diese enthalten jeweils die Daten und dienen zur Steuerung. Der erste Manager ist der Energiemanager, er speichert den Verbrauch. Zur Berechnung ist es allerding notwendig, dass das Reading &ldquo;verbrauchProStunde&ldquo; &uuml;ber das Nutzerinterface gesetzt wird. Der Wert sollte den KWh entsprechen, die verbraucht werden, wenn die Heizung eine Stunde mit voller Leistung heizt.
<br/><br/>
Der Fenstermanager dient zur Fenstersteuerung. Er enth&auml;lt den aktuellen Status, sowie ein Reading, dass eine evtl. Vorhandene Fenstersteuerung ansteuert. Da zur Laufzeit des Projektes nicht die M&ouml;glichkeit zur Installation einer Ansteuerung bestand, ist letzteres nur Vorbereitet und das Notify &ldquo;Sven_UpdateFenstersteuerung&ldquo; muss in der Perlfunktion &ldquo;Sven_UpdateFenstersteuerung&ldquo; f&uuml;r ein echtes Ger&auml;t entsprechend angepasst werden.
<br/><br/>
Als dritter Manager existiert der Temperaturmanager, um die Raumtemperatur zu steuern. Unterst&uuml;tzt wird dieser dabei von dem virtuellen Ger&auml;t &ldquo;Sven_HMVirtuell&ldquo;, welches zur Kommunikation mit den HM-Thermostaten notwendig ist.
<br/><br/>
Der letzte und wichtigste Manager ist der Raummanager. &Uuml;ber ihn k&ouml;nnen die in Abschnitt 6.2 genannten Ger&auml;te dem Raum hinzugef&uuml;gt werden, nachdem diese im Voraus in FHEM angelegt wurden. Die weitere Ansteuerung und Zustands&uuml;berwachung der Ger&auml;te erfolgt anschlie&szlig;end vollautomatisch.
<br/><br/>
Des Weiteren werden noch eine Notify- und At-Ger&auml;te im Raum angelegt, die zur Zustands&uuml;berwachung und automatisierten Ansteuerung dienen angelegt. Zus&auml;tzlich ist noch anzumerken, dass das System in den Pausen automatisch die Fenstersteuerung (aktuell ohne reale Ger&auml;te) anspricht die Fenster entsprechend der Wetterlage zum L&uuml;ften &ouml;ffnet. Dabei gilt das die Fenster nur bei einer Regenwahrscheinlichkeit von unter 80% automatisch ge&ouml;ffnet werden und bei Temperaturen unter 0&deg;C bzw. &Uuml;ber 30&deg;C nur f&uuml;r 5 Minuten und an ansonsten f&uuml;r 15 Minuten ge&ouml;ffnet werden.
<br/><br/>
<h1>Nutzerschnittstelle</h1>
F&uuml;r das Nutzerinterface wurde das Framework FHEM Tablet UI verwendet. Die Verwendung eines vorhandenen Frameworks ersparte viel Zeit bei der Implementierung. Eine Installation des Frameworks erfolgt in simplen Schritten, wie im detailreichen Wiki-Artikel nachgelesen werden kann. Das Framework erm&ouml;glicht es, in FHEM integrierte Ger&auml;te zu steuern und ihren Status anzeigen zu lassen. Geliefert werden diverse HTML-, CSS- und JavaScript-Dateien, welche nach Belieben angepasst werden k&ouml;nnen. Die Konfiguration grafischer Elemente erfolgt mit einer Vielzahl vordefinierter widgets, welche in HTML-Dateien eingebunden werden. Zur Realisierung der Nutzeroberfl&auml;che wurden die folgenden Dateien implementiert: index-html, menu.html, uebersicht.html, auswertung.html, info.html und feedback.html. Diese Dateien spiegeln die in Abschnitt 4.4 beschriebenen Bereiche der Nutzeroberfl&auml;che wider. Die letzten f&uuml;nf Dateien werden dabei f&uuml;r jeden Raum spezifisch generiert, um eine Unterscheidung zwischen den Ger&auml;ten der einzelnen R&auml;ume zu erm&ouml;glichen. Jede Datei integriert dabei ihr jeweiliges Men&uuml; an den linken Rand der Oberfl&auml;che. Es ist auch zu beachten, dass das Layout jeder Datei in x-Richtung f&uuml;nf Bl&ouml;cke und in y-Richtung zwei Bl&ouml;cke gro&szlig; ist, damit die einzelnen Abschnitte m&ouml;glichst gleichm&auml;&szlig;ig aussehen. Da sich in der Auswertungsanzeige drei Elemente untereinander befinden anstelle von zwei, wurde hier die y-Gr&ouml;&szlig;e auf sechs Bl&ouml;cke gesetzt.
<br/><br/>
<h2>Index.html</h2>
Der Einstieg in die Nutzeroberfl&auml;che erfolgt standardm&auml;&szlig;ig &uuml;ber die index.html-Datei. Diese wurde verwendet, um dem Nutzer die Auswahl eines Raumes zu erm&ouml;glichen. Die einzelnen Elemente werden dabei bestehend aus einem Pagetab, welcher die Verkn&uuml;pfung zu einer anderen Datei realisiert und die aktuell geladene Datei durch diese austauscht, sowie einem Label zur Beschriftung in jeweils eine eigene Reihe des Layouts eingef&uuml;gt. Es wurde ein Label verwendet, da die Schriftgr&ouml;&szlig;e der Pagetab-Beschriftung nicht angepasst werden kann. Das Ausw&auml;hlen eines Raumes l&auml;dt die jeweilige uebersicht.html-Datei des Raumes. Um die Verwendung des Nutzerinterfaces auf mobilen Endger&auml;ten zu gestatten, wurden zwei meta-Tags eingef&uuml;gt. In den einzelnen Dateien wurde das Gridster-Layout angewendet. Die einzelnen Elemente dieses Layouts k&ouml;nnen ohne das Meta-Tag &ldquo;gridster_disable&ldquo; flexibel verschoben werden. Damit dies nicht m&ouml;glich ist, wurde das Meta-Tag eingef&uuml;gt. Beim Bedienen der Elemente werden dem Nutzer Toast-Nachrichten angezeigt. Diese wurden durch das Meta-Tag &ldquo;toast content=’0’ unterbunden, um den Nutzer mit den angezeigten FHEM-Befehlen nicht zu verwirren. Zuletzt verf&uuml;gt die Datei noch &uuml;ber eine JavaScript-Funktion zum Ermitteln der Raumbezeichnung aus dem Link und einer Funktion, welche das Feedback des Nutzers aus den im Feedback-Tab befindlichen Selektoren ausliest und an die Datenbank mittels eines XML-Http-Requests zur Verarbeitung weitergibt.
<br/><br/>
<h2>Menu.html</h2>
Das Men&uuml; dient als Verkn&uuml;pfung der einzelnen anderen Dateien, um zwischen diesen hin- und herwechseln zu k&ouml;nnen. Auch hier werden Pagetabs zur Navigation angewendet. Unter den Men&uuml;punkten wird das Logo eingebunden. Das Men&uuml; selbst wird in jeder Seite als Template geladen.
<br/><br/>
<h2>Uebersicht.html</h2>
Diese Datei ist die erste, welche nach der Raumauswahl aufgerufen wird. Mittels dieser Seite werden die Steuerungsm&ouml;glichkeiten angezeigt und Graphen zur zeitlichen Raumnutzung, &Ouml;ffnungszeitr&auml;ume der Fenster, Raumtemperatur und Thermostateinstellung angezeigt. Die Steuerung der Heizung wird dabei &uuml;ber einen Spinner realisiert, welcher die Solltemperatur im Temperaturmanager setzt und zur Anzeige ausliest. Das Setzen der Temperatur wurde dabei auf 23&deg;C beschr&auml;nkt, da dies f&uuml;r ausreichend befunden wurde und eine h&ouml;here Temperatur mehrheitlich als unangenehm empfunden wird. Hierbei ist zu beachten, dass bei einem Umstellen der Temperatur das Umsetzen durch das Funkthermostat oftmals etliche Sekunden dauert und das Spinner-Element w&auml;hrenddessen noch den alten Status ausliest und anzeigt. Der Status des Heizungsventils wird ebenfalls visualisiert. In der darunter befindlichen Reihe wird der Status der Fenster mittels eines Switches visualisiert, welcher die Eigenschaft readonly hat. Das bedeutet, dass dieses Element lediglich zur Anzeige dient. Darunter befindlich kann die Fenstersteuerung genutzt werden, welche dem Fenstermanager entsprechende Befehle erteilt. Abschlie&szlig;end wird die n&auml;chste planm&auml;&szlig;ige L&uuml;ftung des Raumes angezeigt. Auf der rechten Seite befinden sich dann die angesprochenen Grafen, welche die zu visualisierenden Daten aus den Log-Dateien der jeweiligen Manager auslesen.
<br/><br/>
<h2>Info.html</h2>
Im Info-Tab wird der Nutzer mittels eines Textes in einem einzelnen Label aufgekl&auml;rt, was der Name &ldquo;SVEN&ldquo; bedeutet und welche M&ouml;glichkeiten ihm durch die grafische Nutzeroberfl&auml;che geboten werden.
            </div>
        </article>

        <footer></footer>
    </body>
</html>